## **Table Analysis**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("drug200.csv")
data

     Age Sex      BP Cholesterol  Na_to_K   Drug
0     23   F    HIGH        HIGH   25.355  DrugY
1     47   M     LOW        HIGH   13.093  drugC
2     47   M     LOW        HIGH   10.114  drugC
3     28   F  NORMAL        HIGH    7.798  drugX
4     61   F     LOW        HIGH   18.043  DrugY
..   ...  ..     ...         ...      ...    ...
195   56   F     LOW        HIGH   11.567  drugC
196   16   M     LOW        HIGH   12.006  drugC
197   52   M  NORMAL        HIGH    9.894  drugX
198   23   M  NORMAL      NORMAL   14.020  drugX
199   40   F     LOW      NORMAL   11.349  drugX

[200 rows x 6 columns]

In [3]:
data.describe()

              Age     Na_to_K
count  200.000000  200.000000
mean    44.315000   16.084485
std     16.544315    7.223956
min     15.000000    6.269000
25%     31.000000   10.445500
50%     45.000000   13.936500
75%     58.000000   19.380000
max     74.000000   38.247000

In [4]:
data.describe(include = ["object"])

        Sex    BP Cholesterol   Drug
count   200   200         200    200
unique    2     3           2      5
top       M  HIGH        HIGH  DrugY
freq    104    77         103     91

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          200 non-null    int64
 1   Sex          200 non-null    object
 2   BP           200 non-null    object
 3   Cholesterol  200 non-null    object
 4   Na_to_K      200 non-null    float64
 5   Drug         200 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 9.5+ KB

**groupby**

In [7]:
data.groupby(["Drug"]).mean()

             Age    Na_to_K
Drug
DrugY  43.747253  22.374780
drugA  35.869565  10.918783
drugB  62.500000  11.524375
drugC  42.500000  10.633750
drugX  44.018519  10.650556

In [8]:
data.groupby(["Drug"]).std()

             Age   Na_to_K
Drug
DrugY  17.031731  6.060195
drugA   9.696786  2.037642
drugB   7.127412  1.869919
drugC  16.725230  2.045009
drugX  16.435685  2.198091

In [9]:
data.groupby(["BP"]).mean()

              Age    Na_to_K
BP
HIGH    42.233766  17.040623
LOW     47.031250  16.539797
NORMAL  44.084746  14.342746

In [10]:
data.groupby(["Sex"]).mean()

           Age    Na_to_K
Sex
F    42.562500  17.022062
M    45.932692  15.219029

In [11]:
data.groupby(["Sex"]).median()

     Age  Na_to_K
Sex
F     40  14.4405
M     47  13.3455

In [12]:
data.groupby(["Sex"]).max()

     Age      BP Cholesterol  Na_to_K   Drug
Sex
F     74  NORMAL      NORMAL   38.247  drugX
M     74  NORMAL      NORMAL   35.639  drugX

In [13]:
data.groupby(["Sex"]).describe()

       Age                              ...   Na_to_K
     count       mean        std   min  ...       25%      50%       75%     max
Sex                                     ...
F     96.0  42.562500  16.395643  15.0  ...  11.31000  14.4405  21.45125  38.247
M    104.0  45.932692  16.594691  15.0  ...   9.98625  13.3455  18.39700  35.639

[2 rows x 16 columns]

In [14]:
data.groupby(["Sex", "BP"]).mean()

                  Age    Na_to_K
Sex BP
F   HIGH    37.842105  19.000711
    LOW     46.107143  17.747143
    NORMAL  45.233333  13.839033
M   HIGH    46.512821  15.130795
    LOW     47.750000  15.600750
    NORMAL  42.896552  14.863828

In [15]:
data.groupby(["Sex", "BP", "Drug"]).mean()

                        Age    Na_to_K
Sex BP     Drug
F   HIGH   DrugY  34.739130  23.580087
           drugA  32.000000  12.059667
           drugB  58.500000  11.858000
    LOW    DrugY  48.846154  24.732385
           drugC  42.142857  11.549143
           drugX  45.125000  11.819375
    NORMAL DrugY  52.545455  19.871636
           drugX  41.000000  10.346474
M   HIGH   DrugY  41.866667  22.284267
           drugA  38.357143  10.185357
           drugB  64.900000  11.324200
    LOW    DrugY  50.352941  21.319882
           drugC  42.777778   9.921778
           drugX  47.800000  10.989300
    NORMAL DrugY  40.416667  21.412667
           drugX  44.647059  10.241118

In [17]:
data[data["BP"] == "HIGH"].mean()

Age        42.233766
Na_to_K    17.040623
dtype: float64

In [19]:
data.groupby(["BP"]).get_group("HIGH").mean()

Age        42.233766
Na_to_K    17.040623
dtype: float64

In [20]:
data.groupby(["BP"]).get_group("HIGH").aggregate(np.mean)

Age        42.233766
Na_to_K    17.040623
dtype: float64

In [21]:
import seaborn as sns

In [22]:
flights = sns.load_dataset("flights")
flights

     year month  passengers
0    1949   Jan         112
1    1949   Feb         118
2    1949   Mar         132
3    1949   Apr         129
4    1949   May         121
..    ...   ...         ...
139  1960   Aug         606
140  1960   Sep         508
141  1960   Oct         461
142  1960   Nov         390
143  1960   Dec         432

[144 rows x 3 columns]

In [23]:
x = flights.pivot("month", "year", "passengers")
x

year   1949  1950  1951  1952  1953  1954  1955  1956  1957  1958  1959  1960
month
Jan     112   115   145   171   196   204   242   284   315   340   360   417
Feb     118   126   150   180   196   188   233   277   301   318   342   391
Mar     132   141   178   193   236   235   267   317   356   362   406   419
Apr     129   135   163   181   235   227   269   313   348   348   396   461
May     121   125   172   183   229   234   270   318   355   363   420   472
Jun     135   149   178   218   243   264   315   374   422   435   472   535
Jul     148   170   199   230   264   302   364   413   465   491   548   622
Aug     148   170   199   242   272   293   347   405   467   505   559   606
Sep     136   158   184   209   237   259   312   355   404   404   463   508
Oct     119   133   162   191   211   229   274   306   347   359   407   461
Nov     104   114   146   172   180   203   237   271   305   310   362   390
Dec     118   140   166   194   201   229   278   306   336   337   405   432

In [24]:
x.dtypes

year
1949    int64
1950    int64
1951    int64
1952    int64
1953    int64
1954    int64
1955    int64
1956    int64
1957    int64
1958    int64
1959    int64
1960    int64
dtype: object

In [35]:
df = pd.DataFrame({"Delay" : [-4,-3,-1,0,1,2,3,3.5,4,5,10]})
df

    Delay
0    -4.0
1    -3.0
2    -1.0
3     0.0
4     1.0
5     2.0
6     3.0
7     3.5
8     4.0
9     5.0
10   10.0

In [36]:
df.assign(Delay_cat = pd.cut(df["Delay"], bins = [-5,-1,0,999], labels = ["Early","On-time","Delay"]))

    Delay Delay_cat
0    -4.0     Early
1    -3.0     Early
2    -1.0     Early
3     0.0   On-time
4     1.0     Delay
5     2.0     Delay
6     3.0     Delay
7     3.5     Delay
8     4.0     Delay
9     5.0     Delay
10   10.0     Delay

In [40]:
df1 = pd.DataFrame([[9,25]] * 3, columns = ["X", "Y"])
df1

   X   Y
0  9  25
1  9  25
2  9  25

In [41]:
df1.apply(np.sqrt)

     X    Y
0  3.0  5.0
1  3.0  5.0
2  3.0  5.0

In [42]:
df1.apply(np.mean)

X     9.0
Y    25.0
dtype: float64

In [43]:
df1.apply(np.sum, axis = 0)

X    27
Y    75
dtype: int64

In [44]:
df1.apply(np.sum, axis = 1)

0    34
1    34
2    34
dtype: int64

In [45]:
df1.apply(lambda x : [1,2], axis = 1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
dtype: object

In [46]:
df1.apply(lambda x : [1,2], axis = 1, result_type = "expand")

   0  1
0  1  2
1  1  2
2  1  2

In [47]:
df1.apply(lambda x : [1,2], axis = 1, result_type = "broadcast")

   X  Y
0  1  2
1  1  2
2  1  2

In [49]:
from datetime import date
#from datetime import datetime

In [62]:
year = [2002,2011,2012,2013,2014,2015,2016,2017,2018,2019,2021]
month = [12,2,3,4,5,6,7,8,9,10,10]
day = [4,20,12,11,8,5,6,13,10,17,1]

In [63]:
for i,j,k in zip(year, month, day):
  print(date(i,j,k).weekday())

2
6
0
3
3
4
2
6
0
3
4

0. Monday
1. Tuesday
2. Wednesday
3. Thursday
4. Friday
5. Saturday
6. Sunday

In [69]:
for i,j,k in zip(year, month, day):
  print(date(i,j,k).month)

12
2
3
4
5
6
7
8
9
10
10

In [66]:
[date(i,j,k).month for i,j,k in zip(year, month, day)]

[12, 2, 3, 4, 5, 6, 7, 8, 9, 10, 10]